In [1]:
import pandas as pd

# データフレームの作成
data = {"Name":["Alice","Bob","Charlie","David","Eve"],
        "Age":[25,30,35,40,45],}

df = pd.DataFrame(data)
df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [2]:
new_df = df.copy()
new_df

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40
4      Eve   45

In [4]:
new_df.loc[1,"Age"] = None

In [5]:
new_df

      Name   Age
0    Alice  25.0
1      Bob   NaN
2  Charlie  35.0
3    David  40.0
4      Eve  45.0

In [ ]:
# 各カラムでいくつの欠損値があるかを確認　　よく使う
new_df.isnull().sum()

Name    0
Age     1
dtype: int64